//первое задание

// 1)потому что к 1 прибавили 1
// 2)потому что сначала идет присваивание числа 1 к d(из-за b++)
// 3)потому что к "а" прибавляют 1 второй раз, из-за чего "а" равна 3, и к этому прибавляют 2
// 4)потому что "b" равно 2, и к этому прибавляют 2
// 5)потому что к "а" два раза прибавили 1
// 6)потому что к "b" два раза прибавили 1

//второе задание

//х будет равен 5, потому что "а" умножается на 2, и получается 4. И к 4 прибавляют 1


//третье задание

let a = 1;
let b = 2;
if (a >= 0 && b >= 0) {
    alert(a - b);
} else if (a < 0 && b < 0) {
    alert(a * b);
} else {
    alert(a + b)
}



//четвертое задание

